In [9]:
import pandas as pd
import numpy as np

#데이터가 3백만개 기본적으로 64비트로 가져오면 램 터진다
train_orders = pd.read_csv("data/order_products__train.csv", dtype={'order_id': np.uint32,
           'product_id': np.uint16, 'reordered': np.int8, 'add_to_cart_order': np.uint8 })
orders = pd.read_csv("data/orders.csv", dtype={'order_hour_of_day': np.uint8,
           'order_number': np.uint8, 'order_id': np.uint32, 'user_id': np.uint32,
           'order_dow': np.uint8, 'days_since_prior_order': np.float16})

In [10]:
train_orders.head(10)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1
5         1       13176                  6          0
6         1       47209                  7          0
7         1       22035                  8          1
8        36       39612                  1          0
9        36       19660                  2          1

add_to_cart_order (구매 순서)
1. 일찍 산다는건 중요, 늦게 산다는 건 중요
2. 숫자가 근접하면 같이 살 확률이 높아진다

reordered (재주문)

In [11]:
orders.head(10)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
5,3367565,1,prior,6,2,7,19.0
6,550135,1,prior,7,1,9,20.0
7,3108588,1,prior,8,1,14,14.0
8,2295261,1,prior,9,1,16,0.0
9,2550362,1,prior,10,4,8,30.0

In [12]:
orders["user_id"].nunique()

206209

유저수 20만명정도
평균적으로 1명당 15번 구매

In [13]:
orders.head(30)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
5,3367565,1,prior,6,2,7,19.0
6,550135,1,prior,7,1,9,20.0
7,3108588,1,prior,8,1,14,14.0
8,2295261,1,prior,9,1,16,0.0
9,2550362,1,prior,10,4,8,30.0
10,1187899,1,train,11,4,8,14.0
11,2168274,2,prior,1,2,11,NaN
12,1501582,2,prior,2,5,10,10.0
13,1901567,2,prior,3,1,10,3.0
14,738281,2,prior,4,2,10,8.0
15,1673511,2,prior,5,3,11,8.0
16,1199898,2,prior,6,2,9,13.0
17,3194192,2,prior,7,2,12,14.0
18,788338,2,prior,8,1,15,27.0
19,1718559,2,prior,9,2,9,8.0
20,1447487,2,prior,10,1,11,6.0
21,1402090,2,prior,11,1,10,30.0
22,3186735,2,prior,12,1,9,28.0
23,3268552,2,prior,13,4,11,30.0
24,839880,2,prior,14,3,10,13.0
25,1492625,2,train,15,1,11,30.0
26,1374495,3,prior,1,1,14,NaN
27,444309,3,prior,2,3,19,9.0
28,3002854,3,prior,3,3,16,21.0
29,2037211,3,prior,4,2,18,20.0

- order_dow(dayof week): 주문 요일
- order_hour_of_day: 주문 시간대
- days_since_prior_order: 저번 주문으로부터 몇일이 지나서 샀는지

In [14]:
orders["eval_set"].value_counts()

prior    3214874
train     131209
test       75000
Name: eval_set, dtype: int64

In [15]:
orders.eval_set = orders.eval_set.replace({'prior': 0, 'train': 1, 'test':2}).astype(np.uint8)

In [16]:
# 최초 구매라서 null - > 보통 한달 단위로 30
orders.days_since_prior_order = orders.days_since_prior_order.fillna(30).astype(np.uint8)

In [17]:
train_orders = train_orders.merge(orders[['user_id','order_id']], on = 'order_id', how = 'left')
train_orders.head(10)

   order_id  product_id  add_to_cart_order  reordered  user_id
0         1       49302                  1          1   112108
1         1       11109                  2          1   112108
2         1       10246                  3          0   112108
3         1       49683                  4          0   112108
4         1       43633                  5          1   112108
5         1       13176                  6          0   112108
6         1       47209                  7          0   112108
7         1       22035                  8          1   112108
8        36       39612                  1          0    79431
9        36       19660                  2          1    79431

reordered가 0인값은 안 중요: 한번만 샀지, 그 이후로 안 산 것

In [18]:
train_orders = train_orders[train_orders['reordered']==1].drop('reordered',axis=1)
train_orders.head(10)

    order_id  product_id  add_to_cart_order  user_id
0          1       49302                  1   112108
1          1       11109                  2   112108
4          1       43633                  5   112108
7          1       22035                  8   112108
9         36       19660                  2    79431
11        36       43086                  4    79431
12        36       46620                  5    79431
13        36       34497                  6    79431
14        36       48679                  7    79431
15        36       46979                  8    79431

In [19]:
orders.set_index('order_id', drop=False, inplace=True)
orders.head(10)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
order_id,,,,,,,
2539329,2539329,1,0,1,2,8,30
2398795,2398795,1,0,2,3,7,15
473747,473747,1,0,3,3,12,21
2254736,2254736,1,0,4,4,7,29
431534,431534,1,0,5,4,15,28
3367565,3367565,1,0,6,2,7,19
550135,550135,1,0,7,1,9,20
3108588,3108588,1,0,8,1,14,14
2295261,2295261,1,0,9,1,16,0
2550362,2550362,1,0,10,4,8,30

In [20]:
train1=orders[['order_id','eval_set']].loc[orders['eval_set']==1]
train1.head(10)

          order_id  eval_set
order_id
1187899    1187899         1
1492625    1492625         1
2196797    2196797         1
525192      525192         1
880375      880375         1
1094988    1094988         1
1822501    1822501         1
1827621    1827621         1
2316178    2316178         1
2180313    2180313         1

In [21]:
train_orders.groupby('order_id').aggregate({'product_id':lambda x: list(x)})

                                                 product_id
order_id
1                              [49302, 11109, 43633, 22035]
36               [19660, 43086, 46620, 34497, 48679, 46979]
38                                                  [21616]
96                      [20574, 40706, 27966, 24489, 39275]
98        [8859, 19731, 43654, 13176, 4357, 37664, 34065...
112                                    [27104, 21174, 5876]
170                [18394, 37766, 13176, 6236, 5077, 40354]
218                                            [1194, 5578]
226                             [29883, 28427, 7754, 39947]
349                      [33000, 11361, 27695, 5115, 11520]
393        [12078, 6184, 32403, 19828, 16797, 13424, 30591]
456                                          [48118, 35365]
473                                   [20082, 47144, 36441]
631               [21137, 27344, 42265, 13829, 9203, 15842]
762                                                 [21137]
774                                          [43335, 16108]
844        [14992, 21405, 11182, 28289, 9387, 18599, 31766]
878       [48070, 24852, 45066, 21903, 47209, 21137, 271...
915       [17417, 1582, 196, 29529, 42013, 45687, 47931,...
988                                                  [4818]
1001                           [34966, 23517, 26369, 43961]
1032      [11063, 26165, 27966, 8859, 44116, 5450, 9741,...
1042      [24852, 33000, 16083, 10814, 35140, 23094, 28985]
1077                            [13176, 39922, 5258, 21137]
1086                    [13984, 26209, 15261, 24082, 25610]
1119                     [6046, 47626, 18465, 27104, 15937]
1120                                         [47211, 45685]
1139                                         [24852, 21137]
1143                           [42719, 27966, 47209, 24964]
1145      [24852, 1465, 28083, 29657, 16198, 47409, 2220...
...                                                     ...
3420370                  [1485, 44964, 17122, 29101, 41385]
3420381   [45143, 29139, 1529, 5240, 14197, 37245, 48745...
3420425                                 [8048, 10258, 2691]
3420463                        [27307, 31506, 45950, 24323]
3420498                  [46979, 17794, 4605, 16823, 16797]
3420505            [20794, 47521, 29118, 5353, 7559, 26201]
3420578   [790, 37250, 48871, 43183, 43565, 15290, 24184...
3420586          [13539, 44987, 30995, 31510, 40706, 21616]
3420603   [37067, 27730, 11707, 11688, 5250, 5251, 25332...
3420729                                       [46822, 2667]
3420735   [33303, 23916, 19937, 12975, 18994, 13984, 43122]
3420769                        [12145, 21294, 16710, 43295]
3420788   [13176, 37687, 22113, 45554, 39877, 261, 30336...
3420798                                             [45004]
3420802                                              [4149]
3420812   [27086, 33120, 18465, 47209, 46627, 20082, 123...
3420851   [13176, 26427, 19057, 34347, 24964, 27845, 350...
3420857   [21903, 35547, 13176, 24810, 35167, 37646, 475...
3420881                                [28647, 2536, 30266]
3420894   [36714, 32515, 28745, 48848, 10749, 20995, 951...
3420895   [49520, 49281, 25691, 25544, 47626, 3108, 1414...
3420909   [35221, 5194, 28204, 33754, 4957, 25146, 21938...
3420979                                        [47877, 185]
3420996    [24852, 45066, 24035, 14947, 2086, 27423, 12125]
3420998   [36724, 27344, 11520, 30391, 21137, 5876, 2190...
3421049                                             [33424]
3421056                                 [5750, 9340, 21709]
3421058      [15629, 4347, 34466, 6244, 6858, 30316, 32650]
3421063                        [49235, 13565, 14233, 35548]
3421070                                [35951, 16953, 4724]

[122607 rows x 1 columns]

In [22]:
train1['actual'] = train_orders.groupby('order_id').aggregate({'product_id':lambda x: list(x)})
train1['actual']=train1['actual'].fillna('')
train1.head(10)

,order_id,eval_set,actual
order_id,,,
1187899,1187899,1,"[196, 25133, 38928, 26405, 39657, 10258, 13032..."
1492625,1492625,1,"[22963, 7963, 16589, 32792, 41787, 22825, 2485..."
2196797,2196797,1,"[15349, 21413, 40706, 21616]"
525192,525192,1,"[47272, 37999, 13198, 43967, 40852, 17638, 298..."
880375,880375,1,"[15937, 23165, 21903, 41540]"
1094988,1094988,1,"[27555, 42347, 27596, 8834, 26604, 12075, 8467..."
1822501,1822501,1,
1827621,1827621,1,"[27435, 27086, 4210, 19934]"
2316178,2316178,1,"[32115, 28601, 15869, 37434, 3808, 15172, 8744..."
2180313,2180313,1,"[18534, 12720, 16797]"

In [23]:
train1['actual'].apply(lambda x: len(x)).mean()

6.316822778925226

평균 장바구니 갯수: 6.3

In [24]:
n_actual = train1['actual'].apply(lambda x: len(x)).mean()   # 평균 카트 사이즈
test1=orders[['order_id','eval_set']].loc[orders['eval_set']==2]
test1['actual']=' '
test1.head()

          order_id  eval_set actual
order_id
2774568    2774568         2
329954      329954         2
1528013    1528013         2
1376945    1376945         2
1356845    1356845         2

In [25]:
traintest1=pd.concat([train1,test1])
traintest1.set_index('order_id', drop=False, inplace=True)

traintest1.head(10)

,order_id,eval_set,actual
order_id,,,
1187899,1187899,1,"[196, 25133, 38928, 26405, 39657, 10258, 13032..."
1492625,1492625,1,"[22963, 7963, 16589, 32792, 41787, 22825, 2485..."
2196797,2196797,1,"[15349, 21413, 40706, 21616]"
525192,525192,1,"[47272, 37999, 13198, 43967, 40852, 17638, 298..."
880375,880375,1,"[15937, 23165, 21903, 41540]"
1094988,1094988,1,"[27555, 42347, 27596, 8834, 26604, 12075, 8467..."
1822501,1822501,1,
1827621,1827621,1,"[27435, 27086, 4210, 19934]"
2316178,2316178,1,"[32115, 28601, 15869, 37434, 3808, 15172, 8744..."
2180313,2180313,1,"[18534, 12720, 16797]"

In [26]:
import gc
del orders, train1, test1
gc.collect() # 무언가를 제거할때 grabage collecter을 이용해서 램을 최적화
traintest1.tail(10)

          order_id  eval_set actual
order_id
959487      959487         2
701105      701105         2
64567        64567         2
1564541    1564541         2
309211      309211         2
2728930    2728930         2
350108      350108         2
1043943    1043943         2
2821651    2821651         2
803273      803273         2